Configuration/InformationRegisters/АнтропометрияФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АнтропометрияФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рост</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РостДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерОдежды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерОбуви</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерГоловногоУбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПротивогаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерРеспиратора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПерчаток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерРукавиц</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеРазмеров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВводаИзмерений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/InformationRegisters/АнтропометрияФизическихЛиц/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо",
		"ОхранаТруда");
КонецПроцедуры

Функция ПредставлениеАнтропометрииФизическихЛиц(Знач ФизическиеЛица) Экспорт 
	
	Если ТипЗнч(ФизическиеЛица) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ФизическиеЛица = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическиеЛица);
	КонецЕсли;
	
	ПредставлениеРазмеров = НСтр("ru = '<Размеры не введены>'");
	ПредставлениеАнтропометрииФизическихЛиц = Новый Соответствие;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.АнтропометрияФизическихЛиц) Тогда
		Возврат ПредставлениеАнтропометрииФизическихЛиц;
	КонецЕсли;
	
	Для Каждого ФизическоеЛицо Из ФизическиеЛица Цикл
		ПредставлениеАнтропометрииФизическихЛиц.Вставить(ФизическоеЛицо, ПредставлениеРазмеров);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АнтропометрияФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|	АнтропометрияФизическихЛиц.ПредставлениеРазмеров КАК ПредставлениеРазмеров,
		|	АнтропометрияФизическихЛиц.ДатаВводаИзмерений КАК ДатаВводаИзмерений,
		|	АнтропометрияФизическихЛиц.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.АнтропометрияФизическихЛиц КАК АнтропометрияФизическихЛиц
		|ГДЕ
		|	АнтропометрияФизическихЛиц.ФизическоеЛицо В (&ФизическиеЛица)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ПредставлениеАнтропометрииФизическихЛиц;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПредставлениеАнтропометрииФизическихЛиц.Вставить(Выборка.ФизическоеЛицо, Выборка.ПредставлениеРазмеров);
	КонецЦикла;
	
	Возврат ПредставлениеАнтропометрииФизическихЛиц;
	
КонецФункции

#КонецОбласти

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

Процедура СохранитьПрежнийНаборЗаписей(НаборЗаписей, Замещение) Экспорт
	
	ФизическиеЛица = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(НаборЗаписей, Замещение, "ФизическоеЛицо");
	Если ФизическиеЛица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПрежнийНабор = РегистрыБЗК.ЗаписиНабораИзБазыДанных(НаборЗаписей, Замещение);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПрежнийНабор", ПрежнийНабор);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
